Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-10-18.tmx
Source language: bo
Languages: en

source: མགུལ་ཟླུམ་ཞིང་དུང་ལྟར་མཛེས་པ།
en: His throat was round and as beautiful as a conch.

source: སྙིང་ཀ་དཔལ་གྱི་བེའུས་བརྒྱན་པ།
en: His heart area was adorned by the śrīvatsa.

source: རོ་སྟོད་སེང་གེའི་རོ་སྟོད་ལྟར་འདུག་པ།
en: His upper body was like the upper body of a lion.

source: ཐལ་གོང་ཤིན་ཏུ་རྒྱས་པ།
en: His flesh between the shoulder blades was muscular.

source: དཔུང་མ་གོའི་ལྷུན་ལེགས་ཤིང་ཟླུམ་པ།
en: His shoulders were bulky and rounded.

source: ལག་པ་རིང་ལ།
en: His arms were long.

source: དྲ་བས་འབྲེལ་པའི་སོར་མོ་ཅན།
en: His fingers were webbed.

source: རྐ་ལག་འཁོར་ལོས་བརྒྱན་པ།
en: His hands and feet were adorned by wheels.

source: རྐ་ལག་འཇམ་ཞིང་གཞོན་ལ་ཤས་རྒྱས་པ།
en: His hands and feet were soft, young, and thick.

source: བདུན་ཤིན་ཏུ་མཐོ་བ།
en: He had the seven prominences.

source: རྐེད་པ་རྡོ་རྗེ་ལྟར་འདུག་པ།
en: His waist was slim like a vajra’s.

source: ལུས་ཆེ་ཞིང་དྲང་བ།
en: His body was big and straight.

source: བརླ་ཟླུམ་པ།
en: His thighs were round.

source: ཕོ་མཚན་གསང་བའི་སྦུབས་ན་འདུག་པ།
en: His penis was retracted into his body.

source: བྱིན་པ་རི་དགས་ཨེ་ནེ་ཡའི་བྱིན་པ་ལྟར་འདུག་པ།
en: His calves were like the calves of a female blackbuck.

source: སོར་མོ་རིང་བ།
en: His fingers were long.

source: རྐང་པའི་རྟིང་བ་ཡངས་པ།
en: The heels of his feet were wide.

source: འོད་འདོམ་གང་བ་དང་ལྡན་པ།
en: He had a halo a fathom in width.

source: མདོག་གསེར་གྱི་ཁ་དོག་ལྟར་འདུག་པ།
en: He was golden in color.

source: བ་སྤུ་རེ་རེ་ནས་གཡས་ཕྱོགས་སུ་གྱེན་དུ་འཁྱིལ་བ།
en: Each of his body hairs was curled upward to the right.

source: ཤིང་ནྱ་གྲོ་དའི་རྒྱལ་པོ་ལྟར་ཆུ་ཞེང་གབ་པ།
en: He had the circular symmetry of a king banyan tree.

source: ལུས་མཚན་དང་དཔེ་བྱད་བཟང་པོས་ཤིན་ཏུ་བརྒྱན་པ།
en: He was adorned with the signs and features of a superior being.

source: མྱིག་མྱི་འགེབས་ཤིང་མི་རྒོད་པ།
en: His eyes did not blink or waver.

source: དྲན་པ་ཉེ་བར་གནས་པ།
en: He remained in a state of mindfulness.

source: རིའི་རྒྱལ་པོ་ཁ་བ་ཅན་ལྟར་རྩྭ་དང་། ནགས་ཚལ་དང་། སྨན་དང་ཤིང་ཕྲན་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ།
en: He was like the Himalayas, the king of mountains, adorned with various grasses, forests, herbs, and vines.

source: བློ་ཤིན་ཏུ་ཡངས་པ།
en: His intellect was vast.

source: ཡེ་ཤེས་ཀྱི་སྤྱོད་ཡུལ་དང་། ཡུལ་ལ་ཐུབ་པ་མྱེད་པ།
en: He had an invincible range and scope of wisdom.

source: དབྱངས་ཀྱི་དཀྱིལ་འཁོར་གྱི་རྒྱན་སྤྲིན་གྱི་སྒྲ་ལྟ་བུ་དང་ལྡན་པ།
en: The display of the field of his voice was like thunder from the clouds.

source: གཡོ་བ་དང་། རློམ་སེམས་དང་། གཡེང་བ་དང་སྤྲོས་པ་ཐམས་ཅད་དང་བྲལ་བའི་སེམས་དང་ལྡན་པ།
en: His mind was free of all vacillation, conceit, instability, or frivolity.

source: ཡེ་ཤེས་ཀྱི་སྤྱོད་ཡུལ་མ་འདྲེས་པ།
en: He had an unalloyed range of wisdom.

source: སངས་རྒྱས་ཀྱི་ཡུལ་རྒྱ་ཆེན་པོའི་སྣང་བ་ཐོབ་པ།
en: He had attained the illumination of the vast range of the wisdom of buddhahood.

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བ་དང་། གདུལ་བའི་བསམ་པ་རྒྱུན་མྱི་འཆད་པ།
en: He was continuously motivated to ripen and guide all beings.

source: སྙིང་རྗེ་ཆེན་པོའི་དཀྱིལ་འཁོར་ཤིན་ཏུ་ཡངས་པ་སྐྱེས་པ།
en: He had developed the vast field of great compassion.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་ཚུལ་ཡོངས་སུ་གཟུང་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡེ་ཤེས་སྣང་བ་ཡང་དག་པར་བསྐྱེད་པའི་ཕྱིར།
en: He was dedicated to possessing the way of the Dharma of all the tathāgatas. He was dedicated to bringing the light of wisdom to all beings.

source: དེ་བཞིན་གཤེགས་པའི་ཚུལ་རྗེས་སུ་དྲན་ཞིང་འགྲོ་བ་ཐམས་ཅད་ཀྱི་དོན་དུ་འཆག་པ་ལ་ཞུགས་ཏེ།
en: He was mindful of the way of the tathāgatas. He was on the meditation walkway.

source: དྲག་དལ་མྱེད་ཅིང་པད་རལ་མེད་ལ་ཤིན་ཏུ་མཛེས་པར་འཆག་པ།
en: He was walking neither too fast nor too slow, serenely and steadily. He was dressed like the Śuddhāvāsa devas.

source: གནས་གཙང་མའི་ལྷའི་གོས་དང་ལྡན་པ། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མྱི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་གྱི་མགོན་པོ་དང་། མྱི་དང་མྱི་མ་ཡིན་པས་བསྐོར་ཅིང་འདུག་པ་མཐོང་ངོ་།
en: He was encircled by devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, Śakra, Brahmā, the world guardians, humans, and nonhumans.

source: །དགེ་སློང་བལྟ་ན་མཛེས་པ་དེ་འཆག་པའི་ཚེ། ཕྱོགས་མངོན་དུ་གྱུར་པའི་ཕྱོགས་ཀྱི་ལྷ་རྣམས་ཕྱོགས་ཀྱི་དཀྱིལ་འཁོར་ཡོངས་སུ་བསྒྲུབ་པ་བྱེད་དོ།
en: When Sudarśana was going to change the direction in which he was walking, the devas of the directions turned the field of directions around.

source: །རྐང་གིས་འགྲོ་བའི་ལྷ་རྣམས་རིན་པོ་ཆེའི་པདྨོས་གོམ་པ་འདོར་བའི་ཚེ།
en: The devas of walking received his footsteps on precious lotuses.

source: ཡོངས་སུ་བླང་བར་བྱེད་དོ། །མྱེའི་ལྷ་སྣང་བའི་དཀྱིལ་འཁོར་ཟད་མྱི་ཤེས་པ་རྣམས་ཀྱང་། མུན་པ་དང་རབ་རིབ་རྣམ་པར་སེལ་ཏོ།
en: The devas who cause fire, who have unceasing disks of light, dispelled obscuring darkness.

source: །འཛམ་བུ་རྒྱལ་མཚན་གྱི་ནགས་ཚལ་གྱི་ལྷ་རྣམས་ཀྱང་མེ་ཏོག་མང་པོའི་ཆར་མངོན་པར་འབེབས་སོ།
en: The devas of the forest of Jambudhvaja sent down a rain of many flowers.

source: །སའི་ལྷ་མི་གཡོ་བའི་སྙིང་པོ་ཅན་རྣམས་ཀྱང་རིན་པོ་ཆེའི་འབྱུང་གནས་མང་པོ་སྟོན་ཏོ།
en: The devas of the earth, who have the essence of stability, revealed many sources of jewels.

source: །ནམ་མཁའི་ལྷ་ཀུན་ནས་སྣང་བའི་དཔལ་དང་ལྡན་པ་རྣམས་ཀྱང་ནམ་མཁའི་དབྱིངས་ཡོངས་སུ་བརྒྱན་པ་བྱེད་དོ།
en: The devas of the sky, who have the splendor of complete brightness, adorned the surface of the sky.

source: །རྒྱ་མཚོའི་ལྷ་དཔལ་ཀུན་ནས་འབྱུང་བ་རྣམས་ཀྱང་རིན་པོ་ཆེ་དམ་པ་མང་པོས་མངོན་པར་འཐོར་ཏོ།
en: The devas of the ocean, who are the source of splendor, scattered great precious jewels.

source: །རི་རབ་ཀྱི་ལྷ་དྲི་མ་མེད་པའི་སྙིང་པོ་ཅན་རྣམས་ཀྱང་ཐལ་མོ་སྦྱར་ཅིང་ཕྱག་འཚལ་ཏོ།
en: The devas of Sumeru , who have the essence of stainlessness, placed their hands together and paid homage.

source: །རླུང་གི་ལྷ་ཐོགས་པ་མེད་པའི་སྟོབས་ཅན་རྣམས་ཀྱང་། སྤོས་དང་། བདུག་སྤོས་དང་། མེ་ཏོག་འཐོར་བའི་རླུང་རབ་ཏུ་འགྱེད་དོ།
en: The devas of the air, who have unimpeded power, spread breezes that scattered perfume, incense, and flowers.

source: །མཚན་མོའི་ལྷ་གནས་པར་བྱེད་པ་ལུས་ཤིན་ཏུ་བརྒྱན་པ་རྣམས་ཀྱང་ལུས་ཤིན་ཏུ་བཏུད་ཅིང་ཕྱག་འཚལ་ཏོ།
en: The devas of the night, with their bodies bedecked in jewelry, bowed down in homage.

source: །ཉིན་མོའི་ལྷ་རྟག་ཏུ་སད་པར་བྱེད་པའི་དཀྱིལ་འཁོར་ཅན་རྣམས་ཀྱང་ནོར་བུ་རིན་པོ་ཆེ་ཕྱོགས་སྣང་བར་བྱེད་པའི་རྒྱལ་མཚན་ཐོགས་ཤིང་། སྣང་བ་བསྐྱེད་པའི་ཕྱིར་ནམ་མཁའི་དབྱིངས་ལ་འཁོད་དོ།
en: The devas of the daytime, who have the disk that always causes beings to wake were holding banners of precious jewels that illuminated the directions and standing in the sky in order to create light.

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགེ་སློང་བལྟ་ན་སྡུག་པ་གང་ན་བ་དེར་ཕྱིན་ནས། དགེ་སློང་བལྟ་ན་སྡུག་པའི་རྐང་པའི་བོལ་གཉིས་ལ་སྤྱི་བོས་གཏུགས་ཏེ་ཕྱག་འཚལ་ནས། དགེ་སློང་བལྟ་ན་སྡུག་པའི་རྐང་པའི་བོལ་གཉིས་ལ་བཞིན་སྦྱར་ཏེ།
en: Sudhana, the head merchant’s son, approached the bhikṣu Sudarśana and bowed his head onto the surface of the bhikṣu Sudarśana’s feet, covered the surface of the bhikṣu Sudarśana’s feet with kisses, and wiped them well.

source: ལེགས་པར་ཕྱིན་ནས་མདུན་དུ་འདུག་སྟེ། ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་ནས། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་ཚོལ་བ་ཞིག་ལགས་ཏེ།
en: Then Sudhana sat down before the bhikṣu Sudarśana and with his hands placed together said, “Ārya, I am set on the highest, complete enlightenment and am seeking bodhisattva conduct.

source: དེས་སྨྲས་པ། རིགས་ཀྱི་བུ། ཁོ་བོ་ནི་ཚེས་བཏབ་ན་དར་ལ་བབ་པ། རབ་ཏུ་བྱུང་བས་བཏབ་ན་གསར་དུ་ཞུགས་པ་སྟེ།
en: The bhikṣu Sudarśana said, “Noble one, having reached adulthood, I am newly entered into the homeless life.

source: རིགས་ཀྱི་བུ། ཁོ་བོས་ནི་ཚེ་དེ་འདྲ་བ་གཅིག་གིས་དེ་བཞིན་གཤེགས་པ་ཆུ་ཀླུང་གངྒཱ་སུམ་ཅུ་རྩ་བརྒྱད་ཀྱི་དྲུང་དུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་དེ།
en: “Noble one, I have in this one lifetime practiced celibacy before as many tathāgatas as there are grains of sand in thirty-eight Ganges Rivers.

source: བདག་གིས་དེ་བཞིན་གཤེགས་པ་ལ་ལའི་ཞམ་རིང་དུ་ནི་ཉིན་ཞག་གཅིག་དུ་ཚངས་པའི་སྤྱོད་པ་སྤྱད་དོ།
en: I practiced celibacy with some for a day and night.

source: །ལ་ལར་ནི་ཉིན་ཞག་བདུན་དུ།
en: I practiced celibacy with some for seven days.

source: ལ་ལར་ནི་ཟླ་བ་ཕྱེད་དུ།
en: I practiced celibacy with some for half a month.

source: ལ་ལར་ནི་ཟླ་བ་གཅིག་ཏུ།
en: I practiced celibacy with some for a month.

source: ལ་ལར་ནི་ལོ་གཅིག་ཏུ།
en: I practiced celibacy with some for a year.

source: ལ་ལར་ནི་ལོ་བརྒྱར།
en: I practiced celibacy with some for a hundred years.

source: ལ་ལར་ནི་ལོ་སྟོང་དུ།
en: I practiced celibacy with some for a thousand years.

source: ལ་ལར་ནི་ལོ་བརྒྱ་ཕྲག་སྟོང་དུ།
en: I practiced celibacy with some for a hundred thousand years.

source: ལ་ལར་ནི་ལོ་བྱེ་བར།
en: I practiced celibacy with some for ten million years.

source: ལ་ལར་ནི་ལོ་བྱེ་བ་ཁྲག་ཁྲིག་དུ།
en: I practiced celibacy with some for a quintillion years.

source: ལ་ལར་ནི་ལོ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པར།
en: I practiced celibacy with some for an anabhilāpyānabhilāpya­parivarta of years.

source: ལ་ལར་ནི་བསྐལ་པ་བར་མར།
en: I practiced celibacy with some for an intermediate kalpa.

source: ལ་ལར་ནི་བསྐལ་པ་ཕྱེད་དུ། ལ་ལར་ནི་བསྐལ་པར།
en: I practiced celibacy with some for half a kalpa.

source: བདག་གིས་དེ་བཞིན་གཤེགས་པ་ལ་ལའི་ཞམ་རིང་དུ་ནི། བསྐལ་པ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པར་ཚངས་པའི་སྤྱོད་པ་སྤྱད་དེ། བསྐལ་པ་བགྲང་བའི་ཚུལ་འདི་ཉིད་ཀྱིས།
en: I practiced celibacy with some for a kalpa.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལས་ཆོས་བསྟན་པ་ཐོས་ཏེ། གདམས་ངག་དང་། རྗེས་སུ་བསྟན་པ་ཡང་དག་པར་བླངས་སོ།
en: I heard the Dharma from all those tathāgatas and received their instructions and teachings.

source: །སྨོན་ལམ་གྱི་རྒྱུན་ཡོངས་སུ་སྦྱངས་སོ།
en: “I have purified an array of prayers.

source: །ཡང་དག་པར་བསྒྲུབ་པའི་ཡུལ་ལ་ཞུགས་སོ། །སྤྱོད་པའི་དཀྱིལ་འཁོར་ཡོངས་སུ་སྦྱངས་སོ།
en: I have purified the field of conduct that enters the range of realization.

source: །ཕ་རོལ་ཏུ་ཕྱིན་པ་རྒྱ་མཚོ་ཡོངས་སུ་རྫོགས་པར་བྱས་སོ།
en: “I have completed an ocean of the perfections.

source: །མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་རྣམ་པར་འཕྲུལ་པ། ཡོངས་སུ་ཤེས་པར་བྱས་སོ།
en: I have perceived the miraculous manifestations of complete buddhahood.

source: །དེ་དག་གི་ཆོས་ཀྱི་འཁོར་ལོ་འཁོར་བ་ཕན་ཚུན་མ་འདྲེས་པ་དག་ཀྱང་ཡོངས་སུ་བཟུང་ངོ་།
en: I have held their wheels of Dharma each distinct from another.

source: །དེ་དག་གི་སྟོབས་མཉམ་པ་ཉིད་ཀྱང་།
en: “I have realized the equality of their strengths.

source: ཁོང་དུ་ཆུད་པར་བྱས་སོ། །དེ་དག་གིས་བསྟན་པ་ཡང་དམ་པའི་ཆོས་ཟད་པའི་མཐར་ཐུག་གི་བར་དུ་ཡོངས་སུ་བཟུང་ངོ་།
en: I have held their teachings for as long as their Dharma remained.

source: །ཁོ་བོས་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་སྨོན་ལམ་རྣམས་ཀྱང་སྨོན་ལམ་གྱི་དཀྱིལ་འཁོར་གྱི་ཏིང་ངེ་འཛིན་མངོན་པར་བསྒྲུབ་པའི་སྟོབས་ཀྱིས་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་མངོན་པར་བསྒྲུབས་སོ།
en: “I have accomplished, through the power of the accomplishment of the samādhi of the field of prayer, the previous prayers of all those tathāgatas for the purification of my own buddha realm.

source: །ཁོ་བོས་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྣམས་ཀྱང་སྤྱོད་པ་ཐམས་ཅད་ལ་འཇུག་པའི་ཏིང་ངེ་འཛིན་ཐོབ་པའི་སྟོབས་ཀྱིས་རང་གི་སྤྱོད་པ་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་མངོན་པར་བསྒྲུབས་སོ།
en: “I have accomplished, through the power of entering the samādhi of entering all conducts, the past practice of bodhisattva conduct by all those tathāgatas for the purification of my own conduct.

source: །ཁོ་བོས་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་དག་པ་ཡང་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པས་འབྱུང་བའི་སྟོབས་ཀྱིས་མངོན་པར་བསྒྲུབས་སོ། །གཞན་ཡང་རིགས་ཀྱི་བུ།
en: “I have accomplished, through the power of setting forth on completely good conduct, the pure perfections of all those tathāgatas.

source: ཁོ་བོ་འཆག་ས་འདི་ན་འཆག་པའི་ཚེ། ཕྱོགས་ཀྱི་རྒྱུད་ཀྱི་སྒོ་ཐམས་ཅད་ཀྱང་ཤིན་ཏུ་རྣམ་པར་ལྟ་བའི་ཡེ་ཤེས་ཀྱི་སྒོས་མངོན་དུ་འགྱུར་རོ།
en: “Moreover, noble one, because of the gateway of the perfectly observant wisdom, while I am walking on this meditation walkway there come toward me the gateways of the continuums of all directions.

source: །འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་ཀྱི་སྒོ་ཐམས་ཅད་ཀྱང་། སྨོན་ལམ་ཆེན་པོ་མངོན་པར་བསྒྲུབས་པའི་སྟོབས་ཀྱིས་སེམས་བསྐྱེད་པ་གཅིག་ལ་འཇིག་རྟེན་གྱི་ཁམས་བརྗོད་དུ་མེད་པའིའང་བརྗོད་དུ་མེད་པ་འདའ་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་རྣམ་པར་འགྲུབ་པར་འགྱུར་རོ།
en: “Through the arising of a single aspiration, the gateways of the continuums of all world realms are moving further away in order to purify the transcendence of an anabhilāpyānabhilāpya­parivarta of world realms through the power of accomplishing great prayers.

source: །སེམས་ཀྱི་སྐད་ཅིག་གཅིག་ལ་སེམས་ཅན་གྱི་སྤྱོད་པའི་ཚུལ་གྱི་སྒོ་བརྗོད་དུ་མེད་པའི་ཡང་། བརྗོད་དུ་མེད་པ་དག་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་དང་། སྨོན་ལམ་མངོན་པར་བསྒྲུབས་པའི་སྟོབས་ཀྱིས་སྟོབས་བཅུའི་ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་མངོན་སུམ་དུ་འགྱུར་རོ།
en: “In one instant of mind, through the power of accomplishing the bodhisattva’s completely good conduct and prayers, I directly perceive an anabhilāpyānabhilāpya­parivarta of gateways of the ways of conduct among beings in order to complete the wisdoms of the ten strengths.

source: །སེམས་བསྐྱེད་པ་གཅིག་ལ་སངས་རྒྱས་བརྗོད་དུ་མྱེད་པའི་ཡང་། བརྗོད་དུ་མེད་པ་མཐོང་བ་རྣམ་པར་དག་པ་དག་ཀྱང་སྔ་ཕྱིའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་མཆོད་པའི་སྨོན་ལམ་མངོན་པར་བསྒྲུབས་པའི་སྟོབས་ཀྱིས། དེ་བཞིན་གཤེགས་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་། བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ལ་མཆོད་པ་དང་། བསྙེན་བཀུར་བ་དང་། རིམ་གྲོ་བྱ་བའི་ཕྱིར་མངོན་དུ་འགྱུར་རོ།
en: “Through the arising of a single aspiration, through the power of accomplishing the prayers to make offerings to past and future buddhas, I directly perceive the vision of an anabhilāpyānabhilāpya­parivarta of buddha realms in order to make offerings to, serve, and honor tathāgatas as numerous as the atoms in an anabhilāpyānabhilāpya­parivarta of buddha realms.

source: །སེམས་བསྐྱེད་པ་གཅིག་ལ་དེ་བཞིན་གཤེགས་པ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་རྣམས་ཀྱང་ཆོས་ཀྱི་འཁོར་ལོ་ཡོངས་སུ་འཛིན་པའི་གཟུངས་དང་། སྨོན་ལམ་མངོན་པར་བསྒྲུབས་པའི་སྟོབས་ཀྱིས། ཆོས་ཀྱི་ཚུལ་གྲངས་མེད་པ་རྣམ་པར་འཚང་རྒྱ་ཞིང་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་བསམ་པ་ལ་མངོན་པར་འབབ་བོ།
en: “Through the arising of a single aspiration, there falls rain from the clouds of Dharma of an anabhilāpyānabhilāpya­parivarta of tathāgatas through the power of accomplishing the prayers for the mental retention of holding the Dharma wheels that follow countless ways of the Dharma.

source: །སེམས་བསྐྱེད་པ་གཅིག་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྒྱ་མཚོ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་དག་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མྱིག་འཕྲུལ་ལྟ་བུར་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་སྨོན་ལམ་མངོན་པར་བསྒྲུབས་པའི་སྟོབས་ཀྱིས་སྤྱོད་པའི་དཀྱིལ་འཁོར་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་མངོན་དུ་འགྱུར་རོ།
en: “Through the arising of a single aspiration, through the power of the accomplishment of the prayers to fulfill the bodhisattva conduct that are like magical illusions, I directly perceive the ocean of the conduct of an anabhilāpyānabhilāpya­parivarta of bodhisattvas in order to purify all fields of conduct.

source: །སེམས་བསྐྱེད་པ་གཅིག་ལ་ཏིང་ངེ་འཛིན་རྒྱ་མཚོ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་དག་ཀྱང་ཏིང་ངེ་འཛིན་གྱི་སྒོ་གཅིག་ཏུ་ཏིང་ངེ་འཛིན་གྱི་སྒོ་ཐམས་ཅད་ཡང་དག་པར་འདུ་བར་བྱ་བའི་སྨོན་ལམ་མངོན་པར་བསྒྲུབས་པའི་སྟོབས་ཀྱིས་ཏིང་ངེ་འཛིན་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་མངོན་དུ་འགྱུར་རོ།
en: “Through the arising of a single aspiration, through the power of the accomplishment of the prayer to concentrate all the fields of samādhi through a single samādhi, I directly perceive the ocean of an anabhilāpyānabhilāpya­parivarta of samādhis in order to purify all fields of samādhi.

source: །སེམས་བསྐྱེད་པ་གཅིག་ལ་དབང་པོ་རྒྱ་མཚོ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་དག་ཀྱང་དྲན་པའི་མཐར་ཕྱིན་པའི་དབང་པོ་ཐོབ་པར་བྱ་བའི་སྨོན་ལམ་མངོན་པར་བསྒྲུབས་པའི་སྟོབས་ཀྱིས་དབང་པོའི་འཁོར་ལོ་དང་། དུས་ཀྱི་འཁོར་ལོ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་འབྲང་བར་བྱ་བའི་ཕྱིར་མངོན་དུ་འགྱུར་རོ།
en: “Through the arising of a single aspiration, through the power of the accomplishment of the prayer to attain the power of the highest mindfulness, I directly perceive the ocean of an anabhilāpyānabhilāpya­parivarta of powers in order to manifest all the wheels of the powers and the wheels of time.

source: །སེམས་བསྐྱེད་པ་གཅིག་ལ་དུས་ཀྱི་འཁོར་ལོ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་དག་ཀྱང་སེམས་ཅན་ཟད་མི་ཤེས་པ་ཟད་པར་བྱ་བའི་སྨོན་ལམ་མངོན་པར་བསྒྲུབས་པའི་སྟོབས་ཀྱིས་དུས་ཐམས་ཅད་དུ་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བའི་ཕྱིར་མངོན་དུ་འགྱུར་རོ།
en: “Through the arising of a single aspiration, through the power of the accomplishment of the prayer for the end of endless beings, I directly perceive an anabhilāpyānabhilāpya­parivarta of wheels of time in order to turn the wheels of Dharma in all times.

source: །སེམས་བསྐྱེད་པ་གཅིག་ལ་དུས་རྒྱ་མཚོ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་ཐམས་ཅད་ཀྱང་དུས་གཅིག་ཏུ་རྣམ་པར་དགོད་པའི་ཚུལ་ཁོང་དུ་ཆུད་པའི་ཡེ་ཤེས་སྣང་བའི་སྨོན་ལམ་མངོན་པར་བསྒྲུབས་པའི་སྟོབས་ཀྱིས། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་དུས་གསུམ་རྣམ་པར་དགོད་པའི་ཕྱིར་མངོན་སུམ་དུ་འགྱུར་ཏེ།
en: “Through the arising of a single aspiration, through the power of the accomplishment of the prayer for the light of the wisdom of realization, I directly perceive an anabhilāpyānabhilāpya­parivarta of oceans of all three times in order to establish the three times in all world realms in a single time.

source: རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཤིན་ཏུ་ཞི་བར་མི་འགྱུར་བའི་སྒྲོན་མ་ཞེས་བྱ་བ་འདི་ཤེས་པར་ཟད་ན།
en: “However, noble one, I know only this bodhisattva liberation called the never-extinguished lamp of wisdom . How could I know or describe the qualities of the bodhisattvas whose aspiration is like a vajra;

source: ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའ་བསམ་པ་རྡོ་རྗེ་ལྟ་བུ་དང་ལྡན་པ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རིགས་སུ་རིགས་དང་ལྡན་པར་བྱུང་བ་དང་། སྲོག་གི་དབང་པོ་ལ་རྒྱུན་ཆད་པ་མེད་པ།
en: who have been born into the family that is the family of all the tathāgatas; who have the power of unceasing life;

source: ཡེ་ཤེས་ཀྱི་སྒྲོན་མ་ཞི་བར་འགྱུར་བ་མེད་པ།
en: who have a lamp of wisdom that is never extinguished;

source: མི་ཤིགས་མི་ཕྱེད་པའི་ལུས་དང་ལྡན་པ།
en: who have indestructible, unbreakable bodies;

source: སྒྱུ་མའི་རྣམ་པ་ལྟ་བུའི་གཟུགས་ཤིན་ཏུ་གྲུབ་པ།
en: who have accomplished a physical form that is like an illusion;

source: རྒྱུའི་ཆོས་དང་མཉམ་པའི་ཡན་ལག་དང་། ཉིང་ལག་ཏུ་ལྡན་པའི་ལུས་ཅན་འགྲོ་བ་རྣམས་ཀྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྣམ་པར་དམྱིགས་པར་བྱེད་པའི་ལུས་དང་ལྡན་པ།
en: who have bodies that have the limbs and smaller physical parts that accord with being phenomena dependent on causes; who have bodies that are perceived in accordance with the wishes of beings;

source: འགྲོ་བ་ཐམས་ཅད་དང་འདྲ་བའི་གཟུགས་དང་ལུས་དང་ཁ་དོག་དང་། དབྱིབས་དང་ཆུ་ཞེང་ཡོངས་སུ་སྟོན་པ།
en: who demonstrate forms, bodies, colors, shapes, and circumferences that are like those of all beings;

source: མེ་མ་དག་དང་མེ་ལྕེ་དང་། དུག་དང་མཚོན་གྱིས་མི་ཚུགས་པའི་ལུས་དང་ལྡན་པ་རྡོ་རྗེས་ལྟར་སྲ་ཞིང་ཁོར་ཡུག་ལྟར་ཐུག་པ་མེད་པའི་ལུས་ཅན།
en: who have bodies that are unharmed by burning embers, flames, poison, or weapons; whose bodies are as hard as vajras and as invincible as the Cakravāla mountain range;

source: བདུད་དང་ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཀྱི་སྟོབས་ཀྱི་སྟོབས་མེད་པར་བྱེད་པ།
en: who make the power of all māras and adversaries ineffective;

source: འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་རི་བོ་དང་འདྲ་བར་འགྲོ་བ་ཀུན་ལས་མངོན་པར་འཕགས་པའི་ལུས་དང་ལྡན་པ།
en: who resemble a mountain of Jambu River gold; who have bodies that are superior to those of all beings;

source: འགྲོ་བ་ཐམས་ཅད་དུ་རྣམ་པར་དམྱིགས་པའི་གཞི་དང་ལྡན་པ།
en: who are perceived as a refuge by all beings;

source: སྒོ་ཐམས་ཅད་དུ་རྣམ་པར་དམྱིགས་ཤིང་ཐོས་པར་འགྱུར་བ།
en: who are perceived and heard from all sides;

source: འགྲོ་བ་ཐམས་ཅད་ཀྱི་ངོར་བལྟ་བ།
en: who are looked up to with admiration by all beings;

source: ཆོས་ཐམས་ཅད་ཀྱི་སྤྲིན་གྱི་འབྱུང་གནས་སུ་གྱུར་པ།
en: who are the source of the clouds of all the Dharma;

source: ཕྱོགས་ཀུན་ཏུ་རྣམ་པར་སྣང་བ་སྒྲིབ་པའི་རི་ཐམས་ཅད་རྣམ་པར་གཏོར་བས་བལྟ་ན་མཛེས་པ་མི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཤིན་ཏུ་འཇོམས་པས་ཤིན་ཏུ་དཔའ་བར་སྣང་བ་དགེ་བའི་རྩ་བ་རྒྱ་ཆེན་པོའི་རྒྱུ་འཐུན་པ་ལས་བྱུང་བས་བལྟ་ན་དགའ་བ་འབྱུང་བར་ཤིན་ཏུ་དཀའ་ཞིང་དཀོན་པས་མེ་ཏོག་ཨུ་དུམ་བཱ་ར་ལྟ་བུ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: who illuminate every direction; who appear beautiful as a result of destroying the mountains of obscurations; who appear as supreme heroes because they defeat all the roots of demerit; who are a joy to see because they originate from vast roots of merit; and who are as rare as fig flowers?”

source: ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན།
en: “Depart, noble one.

source: །སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་ཡུལ་དགེ་སྦྱོང་གི་དཀྱིལ་འཁོར་ཞེས་བྱ་བ་ན་གྲོང་ཁྱེར་སྒོ་བཟང་པོ་ཞེས་བྱ་བ་ཡོད་དེ།
en: In this southern region there is a city called Sumukha in the land called Śramaṇa­maṇḍala.

source: དེ་ན་ཁྱེའུ་དབང་པོའི་དབང་ཕྱུག་ཅེས་བྱ་བ་འདུག་གིས།
en: “There dwells a boy by the name of Indriyeśvara.

source: དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་གནོན་པ་དང་། ནན་ཏན་རྣམ་པར་དག་པར་བྱ་བ་ལ་བརྩོན་པ།
en: Go to him and ask him, ‘How does a bodhisattva train in bodhisattva conduct? How does a bodhisattva practice it?’ ” Sudhana, the head merchant’s son, was dedicated to the pure prowess and practice of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་སྟོབས་སྣང་བས་སེམས་ཤིན་ཏུ་སྣང་བར་གྱུར་པ།
en: His mind was illuminated by the light of the power of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་བརྟན་པ་གཞན་གྱིས་མི་ཐུབ་ཅིང་བརྒལ་ཐག་ཆད་པའི་སྙིང་དང་ལྡན་པ།
en: In his heart he had mastered the unconquerable fortitude of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་གྱི་གོ་ཆ་བཟངས་པོས་སེམས་ཞུམ་པ་མེད་པ།
en: His mind was indefatigable because of the excellent armor of the resolution of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་བསམ་པ་བརྟན་པས་ཀུན་ཏུ་གནས་ཤིང་ཡོངས་སུ་འཕེལ་བར་འགྱུར་བ་ལ་བརྩོན་པ།
en: He was dedicated to the stability and vastness of the resolute aspiration of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་སྤྲིན་གྱི་ཆར་ཡོངས་སུ་འཛིན་པའི་བསམ་པ་དང་ལྡན་པ།
en: He had the aspiration to possess all the rain from the clouds of bodhisattva conduct.

source: བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་གྱིས་ཡོངས་སུ་མི་ངོམས་པའི་རྒྱུད་དང་ལྡན་པ།
en: He had the continuity of never having enough of the rain from the clouds of Dharma of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་ཐམས་ཅད་ལ་འཇུག་པའི་སྨོན་ལམ་ལ་མངོན་དུ་གྱུར་པ།
en: He had the aspiration directed toward realizing all the qualities of the bodhisattvas.

source: འགྲོ་བ་ཐམས་ཅད་ཀྱི་ཁ་ལོ་བསྒྱུར་བས་ཡོངས་སུ་སྡུད་པར་བདག་ཉིད་ཡོངས་སུ་གཏོང་བར་འདོད་པ་འགྲོ་བ་ཐམས་ཅད་འཁོར་བའི་དགོན་པ་ཆེན་པོ་ལས་བཟླ་བར་འདོད་པ།
en: He longed to send himself to be the embodiment of the charioteers for all beings. He longed to lead beings out beyond the great forest of saṃsāra.

source: དགེ་བའི་བཤེས་གཉེན་བལྟ་བ་དང་། མཉན་པ་དང་། བསྙེན་བཀུར་བས་ཡོངས་སུ་མི་ངོམས་པ།
en: He never had enough of gazing upon, listening to, and honoring kalyāṇamitras.

source: ཆོས་ཀྱི་རིམ་གྲོ་ཚད་མེད་པ་བསྐྱེད་པ་དང་ལྡན་པ་དེས།
en: He had developed an immeasurable veneration for the Dharma.

source: དགེ་སློང་བལྟ་ན་སྡུག་པའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། དགེ་སློང་བལྟ་ན་སྡུག་པ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཡང་དང་ཡང་བལྟས་ཏེ། དགེ་སློང་བལྟ་ན་སྡུག་པའི་དྲུང་ནས་སོང་ངོ་།། །།༄༅༅། །སངས་རྒྱས་ཕལ་པོ་ཆེ་ཞེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ།
en: Sudhana, the head merchant’s son, bowed his head to the feet of the bhikṣu Sudarśana, circumambulated the bhikṣu Sudarśana many hundreds of thousands of times, keeping him to his right, and, looking back again and again, departed from the presence of the bhikṣu Sudarśana.

source: །བམ་པོ་དང་པོ།
en: Indriyeśvara
